{
  "floors": [
    {
      "id": "1",
      "number": 1,
      "name": "Town of Beginnings",
      "tags": ["SAFE ZONE", "NO MOBS"],
      "info": [
        "Safe Zone — No Mobs",
        "First Spawn / Starting Location",
        "Main Shop, Inn, NPCs",
        "Black Iron Palace"
      ],
      "activities": [
        "Change Appearance",
        "Fishing",
        "Blacksmithing / Crafting",
        "Amphitheater Seating / Meeting"
      ],
      "shops": [
        "Starter Shop",
        "Misc Merchant",
        "Event Shop"
      ],
      "lore": [
  "Floor 1 is where the system first locks you in — a safe zone that feels calm for a reason.",
  "Most players gather here before stepping into real combat zones.",
  "The Black Iron Palace is treated like a monument… and a warning."
],
      "map": {
        "image": "/images/floors/floor1map.png",
        "alt": "Floor 1 map",
        "callouts": [
          { "label": "Starter Shop", "top": "45%", "left": "81%" },
          { "label": "Potion Shop", "top": "28%", "right": "15%" },
          { "label": "Blacksmith", "top": "45%", "right": "20%" },
          { "label": "Event Shop", "bottom": "56%", "right": "2%" },
          { "label": "Cole’s Cuts", "bottom": "68%", "left": "59%" },
          { "label": "Spawn", "bottom": "57%", "left": "37%" },
          { "label": "Black Iron Palace", "bottom": "58%", "left": "10%" }
        ]
      },
      "systemNote": "Floor 1 is the primary safe hub for new players."
    },

    {
      "id": "2",
      "number": 2,
      "name": "Swordsman Fields",
      "tags": ["COMBAT ZONE", "FIELD MOBS"],
      "info": [
        "First Combat Area",
        "Home of Illfang the Kobold Lord (Boss)",
        "Boars/Wolves (Mobs)"
      ],
      "activities": [
        "Mob Grinding",
        "Side Quests",
        "Material Farming"
      ],
      "shops": [
        "Floor 2 Shop",
        "Guild Merchants"
      ],
      "lore": [
  "Swordsman Fields is where safety ends and survival begins. Beyond the Town of Beginnings, the land opens into rolling plains filled with restless monsters and inexperienced adventurers testing their strength.",
  "The fields appear peaceful at first glance — wind through tall grass, distant hills, scattered ruins — but danger spawns relentlessly. Boars charge without warning, wolves hunt in packs, and hesitation is punished swiftly.",
  "At the far end of the floor stands the looming Boss Tower, home to Illfang the Kobold Lord. The structure can be seen from nearly anywhere in the fields, a constant reminder that progress demands coordination.",
  "Many guilds form here out of necessity rather than ambition. Players quickly learn that reckless solo grinding leads to shattered HP bars and broken morale.",
  "Veteran players often say the system subtly adjusts aggression on this floor — as if measuring whether newcomers are worthy of advancing. Whether rumor or reality, one truth remains: Floor 2 decides who will continue climbing… and who will not."
],
      "map": {
        "image": "/images/floors/floor2map.png",
        "alt": "Floor 2 map",
        "callouts": [
          { "label": "Spawn", "top": "33%", "left": "3%" },
          { "label": "Village", "top": "48%", "left": "45%" },
          { "label": "Guild Merchants", "top": "55%", "left": "40%" },
          { "label": "Shop", "top": "62%", "left": "50%" },
          { "label": "Mine", "top": "38%", "left": "63%" },
          { "label": "Tower", "top": "82%", "left": "86%" }
        ]
      },
      "systemNote": "Floor 2 is the beginning floor for leveling."
    },

    {
      "id": "3",
      "number": 3,
      "name": "Swamp Land",
      "tags": ["COMBAT ZONE", "SWAMP MOBS"],
      "info": [
        
      ],
      "activities": [
        
      ],
      "shops": [
        "Floor 3 Shop"
      ],
      "lore": [
  "The Swamp Lands is where warmth dies and comfort becomes a memory. The air hangs heavy and damp, clinging to armor and skin alike. Cold mist rolls endlessly across flooded plains, turning every breath into a chilling reminder that this floor was never meant to nurture life.",
  "At first glance the marsh seems still — shallow waters stretching beneath a gray sky, moss-covered ruins barely rising above the mire — but the silence is deceptive. Beneath the murk, serpents coil unseen, crocodiles drift like shadows, and unseen creatures disturb the surface with sudden, violent splashes.",
  "The water never truly dries. Boots remain soaked, footing slips without warning, and the chill seeps through metal and cloth until stamina drains as surely as HP. Players who linger too long find their movements sluggish, their reactions dulled by the relentless cold.",
  "Rising from the flooded expanse stands the Slime Caverns, a stone structure emerging from the swamp like a monument to decay. It looms in the fog from nearly every direction, its entrance the only promise of progress — and the source of the swamp’s corruption.",
  "Within the cavern’s slick, twisting corridors, moisture drips endlessly from the ceiling as giant snails gather in flooded chambers. At the center waits Lord Slug, grotesque sovereign of stagnation. His presence thickens the very water around him, turning the swamp itself into a weapon. Floor 3 is not conquered through haste or bravery alone — it is endured. And those who cannot withstand the cold, the wet, and the weight of the mire will simply disappear beneath it."
],
      "map": {
        "image": "/images/floors/floor3map.png",
        "alt": "Floor 3 map",
        "callouts": [
          { "label": "Spawn", "top": "33%", "left": "3%" },
          { "label": "Village", "top": "48%", "left": "45%" },
          { "label": "Guild Merchants", "top": "55%", "left": "40%" },
          { "label": "Shop", "top": "62%", "left": "50%" },
          { "label": "Mine", "top": "38%", "left": "63%" },
          { "label": "Tower", "top": "82%", "left": "86%" }
        ]
      },
      "systemNote": "Floor 3 is a swamp. Damp and cold, with just snakes and snails to keep you company."
    }
  ]
}
